procedure ViewGiven; { grid }

begin
  textcolor(13);
  writexy(26,2,'Stormdoku');
  textcolor(COL1);
  writexy( LEFT, UP   ,  'ษอออออออออออหอออออออออออหอออออออออออป' );
  writexy( LEFT, UP+ 1,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+ 2,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+ 3,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+ 4,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+ 5,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+ 6,  'ฬอออออออออออฮอออออออออออฮอออออออออออน' );
  writexy( LEFT, UP+ 7,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+ 8,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+ 9,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+10,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+11,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+12,  'ฬอออออออออออฮอออออออออออฮอออออออออออน' );
  writexy( LEFT, UP+13,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+14,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+15,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+16,  'บ---+---+---บ---+---+---บ---+---+---บ' );
  writexy( LEFT, UP+17,  'บ   |   |   บ   |   |   บ   |   |   บ' );
  writexy( LEFT, UP+18,  'ศอออออออออออสอออออออออออสอออออออออออผ' );
  textcolor(8);
  writexy(42,23,'Build 8');
  writexy(42,24,'Vrs .88');
  textcolor(COL1);
end;

procedure ViewPM; { pm grid }
begin
textcolor(27);
writexy(50,33,'Pencil Mark');
textcolor(19);
writexy( 1 , up+30, 'ษอออออออออออออออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออหอออออออออออออออออออออออออออออออออออป');
writexy( 1 , up+31, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+32, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+33, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+34, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+35, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+36, 'ฬอออออออออออออออออออออออออออออออออออฮอออออออออออออออออออออออออออออออออออฮอออออออออออออออออออออออออออออออออออน');
writexy( 1 , up+37, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+38, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+39, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+40, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+41, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+42, 'ฬอออออออออออออออออออออออออออออออออออฮอออออออออออออออออออออออออออออออออออฮอออออออออออออออออออออออออออออออออออน');
writexy( 1 , up+43, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+44, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+45, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+46, 'บ-----------+-----------+-----------บ-----------+-----------+-----------บ-----------+-----------+-----------บ');
writexy( 1 , up+47, 'บ           |           |           บ           |           |           บ           |           |           บ');
writexy( 1 , up+48, 'ศอออออออออออออออออออออออออออออออออออสอออออออออออออออออออออออออออออออออออสอออออออออออออออออออออออออออออออออออผ');
textcolor(col2);
end;


procedure displayTechnique;
var
n:integer;
begin
textcolor(6);
writexy(162,33,'Technique Applied');
textcolor(COL1);
writexy(116, 34,'ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป');
for n:= 0 to 25 do
 begin
 writexy(116,(35+n),'บ');
 writexy(233,(35+n),'บ');
 end;
writexy(116, 60,'ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ');
textcolor(col2);

end;